using System;
using System.Collections.Generic;
using System.Text;

namespace Check.Rule.Helper
{
    public static class ErrMsgFormat
    {
        /// <summary>
        /// 提交的资料中[文件夹名称]文件夹名称有误，应按[命名规则]规则命名
        /// </summary>
        public const string ERR_110100001_1 = "提交的成果资料中'{0}'文件夹名称有误，应按'{1}'规则命名";


        /// <summary>
        /// 提交的资料中'[文件夹名称]'文件夹下缺少'[文件夹名称]'文件夹或文件夹名称有误
        /// </summary>
        public const string ERR_110100001_2 = "提交的成果资料中‘{0}’文件夹下缺少‘{1}’文件夹或文件夹名称有误";

        /// <summary>
        /// 提交的资料中缺少[以‘[标准命名]’命名的][[文件类型]]其中[文件类型]指：矢量文件/扫描资料/文字报告/汇总表格文件/元数据文件
        /// </summary>
        public const string ERR_110200001 = "提交的成果资料中缺少以'{0}'命名的{1}文件";

        /// <summary>
        /// 提交的[文件名]文件[原因描述]无法导入质量检查软件
        /// </summary>
        public const string ERR_120100001 = "提交的'{0}'文件'{1}'无法导入质量检查软件";

        /// <summary>
        /// [文件名]文件中[‘[上级节点名称]’节点下]缺少‘[节点名称]’节点
        /// </summary>
        public const string ERR_210110001 = "{0}文件中'{1}'节点下缺少'{2}'节点";
        public const string ERR_210110001_1 = "{0}文件中缺少'{1}'节点";
        /// <summary>
        /// 矢量数据中缺失‘[图层名]’层
        /// </summary>
        public const string ERR_310100001_1 = "矢量数据中缺失‘{0}’层";

        /// <summary>
        /// 矢量数据中‘[图层名]’层为多余图层
        /// </summary>
        public const string ERR_310100001_2 = "矢量数据中‘{0}’层为多余图层";

        /// <summary>
        /// 矢量数据的‘[ 数学基础参数]’参数定义不符合上报要求。平面坐标系统应为‘1980西安坐标系’，高程系统应采用‘1985国家高程基准’，投影方式应为‘高斯-克吕格投影’。其中[数学基础参数]包括：平面坐标系统、高程系统、投影方式
        /// </summary>
        public const string ERR_320100001 = "矢量数据的‘{0}’参数定义不符合上报要求。平面坐标系统应为‘1980西安坐标系’，高程系统应采用‘1985国家高程基准’，投影方式应为‘高斯-克吕格投影’。其中[数学基础参数]包括：平面坐标系统、高程系统、投影方式";

        /// <summary>
        /// [图层名]层[字段名称]字段为多余字段
        /// </summary>
        public const string ERR_410100001_1 = "{0}层'{1}'字段为多余字段";

        /// <summary>
        /// [图层名]层字段不完整，缺失[字段名称]字段
        /// </summary>
        public const string ERR_410100001_2 = "{0}层字段不完整，缺失'{1}'字段";

        /// <summary>
        /// [图层名]层[字段名称]字段的类型不符合标准[(数据库中为：[数据库中字段类型]，标准为：[标准字段类型])]
        /// </summary>
        public const string ERR_410100001_3 = "{0}层'{1}'字段的数据类型不符合标准(数据库中为：{2}，标准为：{3})";


        /// <summary>
        /// [图层名]层[字段名称]字段的长度不符合标准[(数据库中为：[数据库中字段长度])，标准为：[标准字段长度])]
        /// </summary>
        public const string ERR_410100001_4 = "{0}层'{1}'字段的长度不符合标准(数据库中为：{2}，标准为：{3})";

        /// <summary>
        /// [图层名]层标识码为[标识码值]的‘[字段名]’内容不正确，不能为空
        /// </summary>
        public const string ERR_4201_1 = "{0}层标识码为{1}的‘{2}’内容不正确，不能为空";

        /// <summary>
        /// [图层名]层[标识码为[标识码值]的]‘[字段名]’值([数据库中字段值])不正确。应大于[或] [等于][最小值][且小于[等于][最大值]]
        /// </summary>
        public const string ERR_4201_2 = "{0}层标识码为{1}的‘{2}’值({3})不正确。{4}";

        /// <summary>
        /// 线状地物层线状地物宽度([实际值])不正确。当比例尺为[比例尺]时，线状地物的实地宽度应小于[最大值]。
        /// </summary>
        public const string ERR_4201_3 = "线状地物层线状地物宽度({0})不正确。当比例尺为{1}时，线状地物的实地宽度应小于{2}";

        /// <summary>
        /// [图层名]层标识码为[标识码值]的[字段名]([数据库中字段值])不正确。应为：[标准值]
        /// </summary>
        public const string ERR_4201_4 = "{0}层标识码为{1}的{2}({3}不正确。应为：{4}";

        /// <summary>
        /// [图层名]层标识码为[标识码值]的[字段名]([数据库中字段值])不正确，正确值范围为([代码表])其中：标准值为多个时用”、”分割
        /// </summary>
        public const string ERR_4201_5_1 = "{0}层标识码为{1}的{2}({3})不正确，正确值范围为({4})其中：标准值为多个时用”、”分割";

        /// <summary>
        /// [图层名]层标识码为[标识码值]的[字段名]([数据库中字段值])不正确，正确值参见：[代码表]
        /// </summary>
        public const string ERR_4201_5_2 = "{0}层标识码为{1}的{2}({3})不正确，正确值参见：{4}";

        /// <summary>
        /// [图层名]层标识码[标识码值]的[字段名]的值([数据中字段内容])存在重复
        /// </summary>
        public const string ERR_4201_6 = "'{0}'层中标识码'{1}'和'{2}'的属性字段'{3}'的值'{4}'存在重复";

        /// <summary>
        /// 数据库中‘[耕地坡度级]扣除地类系数’与下发的‘[耕地坡度级]扣除地类系数’不匹配
        /// </summary>
        public const string ERR_420100039 = "数据库中‘{0}扣除地类系数’与下发的‘{1}扣除地类系数’不匹配";

        /// <summary>
        /// 数据库中[图层名]标识码为111的[字段名]([图斑面积])与计算的椭球面积([计算的椭球面积])不一致，两者差值为[差值]平方米
        /// </summary>
        public const string ERR_4401 = "数据库中{0}标识码为{1}的{2}({3})与计算的椭球面积({4})不一致，两者差值为{5}平方米";

        /// <summary>
        /// 地类图斑层的图斑面积汇总值([图斑面积汇总值])与行政区层的控制面积汇总值([行政区层的控制面积汇总值])不一致，两者差值为[差值]
        /// </summary>
        public const string ERR_450101031 = "地类图斑层的图斑面积汇总值({0})与行政区层的控制面积汇总值({1})不一致，两者差值为{2}";

        /// <summary>
        /// 地类图斑层的线状地物面积汇总值([地类图斑层的线状地物面积汇总值])与线状地物层的线状地物面积汇总值([线状地物层的线状地物面积汇总值])不一致，两者差值为[差值]
        /// </summary>
        public const string ERR_450103052 = "地类图斑层的线状地物面积汇总值({0})与线状地物层的线状地物面积汇总值({1})不一致，两者差值为{2}";

        /// <summary>
        /// 地类图斑层的零星地物面积汇总值([地类图斑层的零星地物面积汇总值])与零星地物层的面积汇总值([零星地物层的面积汇总值])不一致，两者差值为[差值]
        /// </summary>
        public const string ERR_450103123 = "地类图斑层的零星地物面积汇总值({0})与零星地物层的面积汇总值({1})不一致，两者差值为{2}";

        /// <summary>
        /// 地类图斑层的图斑地类面积汇总值+地类图斑层的扣除地类面积汇总值+线状地物层的线状地物面积汇总值+零星地物层的面积汇总值([图斑面积汇总值])与行政区层的控制面积汇总值([行政区层的控制面积汇总值])不一致，两者差值为[差值]
        /// </summary>
        public const string ERR_450101034 = "地类图斑层的图斑地类面积汇总值+地类图斑层的扣除地类面积汇总值+线状地物层的线状地物面积汇总值+零星地物层的面积汇总值({0})与行政区层的控制面积汇总值({1})不一致，两者差值为{2}";

        /// <summary>
        /// [图层名]内标识码为‘[标识码值]’与标识码为‘[标识码值]’的地物相互重叠。实地两相邻点距离应小于[容差值]米
        /// </summary>
        public const string ERR_5101_1 = "{0}内标识码为‘{1}’与标识码为‘{2}’的地物相互重叠。实地两相邻点距离应小于{3}米";

        /// <summary>
        /// [图层名]内标识码为‘[标识码值]’与标识码为‘[标识码值]’的地物相互重叠。
        /// </summary>
        public const string ERR_5101_2 = "{0}内标识码为‘{1}’与标识码为‘{2}’的地物相互重叠";

        /// <summary>
        /// [图层名]内标识码为‘[标识码值]’与标识码为‘[标识码值]’的图斑相互重叠。
        /// </summary>
        public const string ERR_5101_3 = "{0}内标识码为‘{1}’与标识码为‘{2}’的图斑相互重叠";

        /// <summary>
        /// [图层名]内标识码为‘[标识码值]’的地物自相交
        /// </summary>
        public const string ERR_5102 = "{0}内标识码为‘{1}’的地物自相交";
        public const string ERR_5103 = "{0}";
        public const string ERR_5104 = "{0}";
        public const string ERR_5105 = "{0}内标识码为‘{1}’的图斑自相交";

        public const string ERR_5106 = "{0}内标识码为‘{1}’的图斑与相邻图斑之间存在缝隙";

        public const string ERR_5107 = "{0}";

        /// <summary>
        /// [图层名]内标识码为‘[标识码值]’与标识码为‘[标识码值]’的地物相交
        /// </summary>
        public const string ERR_5108 = "{0}内标识码为‘{1}’与标识码为‘{2}’的地物相交";

        public const string ERR_5109 = "{0}";

        /// <summary>
        /// [面状图层名]内标识码为‘[标识码值]’[面状图层名]边界与[线状图层名]层的地物不一致。[面状图层名]边界处应存在对应的[线状图层名]
        /// </summary>
        public const string ERR_5110 = "{0}内标识码为‘{1}’的{0}边界与{2}层的地物不一致。{0}边界处应存在对应的{2}";

        public const string ERR_5111 = "{0}";
        public const string ERR_5112 = "{0}";
        public const string ERR_511203051 = "线状地物图层中标识码为‘{0}’的线状地物与相邻的两个地类图斑边界不一致。位于地类图斑边界处的线状地物应与相邻两个地类图斑的边界完全重叠";
        public const string ERR_5113 = "{0}层内标识码为‘{1}’的<2>与{3}层内对应的{4}不一致";

        /// <summary>
        /// 线层要素的端点处必须存在点层要素
        /// [线图层]层内标识码为‘[193]’的[线图层]，其端点处无[点图层]。[线图层]的端点处必须存在[点图层]。
        /// </summary>
        public const string ERR_5114 = "{0}层内标识码为‘{1}’的{0}，其端点处无{2}。{0}的端点处必须存在{2}";


        public const string ERR_5201 = "{0}层内{1}存在丢漏。{2}必须在行政区范围内全覆盖";


        public const string ERR_5301 = "{0}";
        public const string ERR_530100091 = "{0}层内标识码为‘{1}’、面积为{2}的{3}是碎片多边形。不符合图斑最小上图面积(0.1)的要求";

        public const string ERR_5401 = "{0}";

        /// <summary>
        /// 线层线状地物长度必须大于实地长度规定数值\r\n
        /// 线状地物层内标识码为‘193’、长度为0.1的线状地物是碎线。不符合最小上图距离(0.2)的要求。
        /// </summary>
        public const string ERR_540100071 = "{0}层内标识码为‘{1}’、长度为{2}的{0}是碎线。不符合最小上图距离({3})的要求";
        public const string ERR_540100071_1 = "{0}层内标识码为‘{1}’的{0}是碎线。不符合最小上图距离({2})的要求";

        public const string ERR_5501 = "提交的矢量数据中行政区边界与省级下发的县级行政区边界不一致";


        public const string ERR_6101 = "{0}";
        public const string ERR_610100031 = "地类图斑层中标识码为‘{0}’的图斑座落单位代码({1})不正确。其与行政区图层中标识码为‘{2}’的行政区划代码({3})不匹配";
        public const string ERR_610100121 = "零星地物层中标识码为‘{0}’的座落图斑编号({1})不正确。其与地类图斑层中该零星地物所座落的地类图斑的图斑编号({2})不匹配";
        public const string ERR_610104054 = "地类界线层中标识码为‘{0}’的地类界线类型({1})不正确，应为‘{2}";

        public const string ERR_6201 = "{0}";
        public const string ERR_620100011 = "{0}层标识码为{1}的{2}‘{3}’与{4}‘{5}’不匹配。当{6}为‘{7}’时， {8}应为‘{9}’";
        public const string ERR_620100033 = "地类图斑层的图斑编号‘{0}’在行政区代码为‘{2}’的村内重复";
        public const string ERR_620100034 = "地类图斑层标识码为‘{0}’扣除类型({1})与扣除地类编码({2})不匹配。当扣除类型为‘{3}’时，扣除地类编码应该为‘{4}’";
        public const string ERR_620100035 = "地类图斑层标识码为‘{0}’的图斑地类面积({1})不正确。根据图斑地类面积计算公式，其结果应为‘{2}’";
        public const string ERR_620100036 = "地类图斑层标识码为‘{0}’的扣除地类面积({1})不正确。根据扣除地类面积计算公式，其结果应为‘{2}’";
        public const string ERR_620100037 = "地类图斑层标识码为‘{0}’的扣除图斑编号2与扣除比例({1})逻辑关系不匹配。当线状地物需要从两个图斑扣除面积时，扣除图斑编号2为必填，扣除比例为0.5。否则扣除图斑编号2为空，扣除比例为1";
        public const string ERR_620100053 = "线状地物层标识码为‘{0}’的线状地物面积({1})不正确。根据线状地物面积计算公式，其结果应为‘{2}’";

        public const string ERR_6301 = "{0}";
        /// <summary>
        /// 所有层要素的标识码必须在整个数据库唯一
        /// [图层名]层与[图层名]层中标识码‘[数据中重复]’重复
        /// </summary>
        public const string ERR_630100001 = "{0}层与{1}层中标识码‘{2}’重复";


        public const string ERR_810160011 = "农村土地利用现状一级分类面积汇总表中{0}村的行政区域总面积（{1}公顷）与该村的各一级地类面积之和（{2}公顷）不一致，两者差值{3}公顷";
        public const string ERR_810160012 = "农村土地利用现状一级分类面积汇总表中{0}乡的行政区域总面积({1}公顷)与所辖各村的行政区域总面积之和({2}公顷)不一致，两者差值{3}公顷";
        public const string ERR_810160013 = "农村土地利用现状一级分类面积汇总表中行政区域总面积({0}公顷)与所辖各乡级行政区域面积之和({1}公顷)不一致，两者差值{2}公顷";
        
        public const string ERR_810160031 = "农村土地利用现状二级分类面积汇总表中{0}村的{1}地类面积({2}公顷)与{3}地类二级地类面积之和({4}公顷)不一致，两者差值{5}公顷";
        public const string ERR_810160032 = "农村土地利用现状二级分类面积汇总表中{0}乡的{1}面积({2}公顷)与该乡所辖各村的{3}面积之和({4}公顷)不一致，两者差值{5}公顷";
        public const string ERR_810160033 = "农村土地利用现状二级分类面积汇总表中{0}面积({1}公顷)与所辖各乡{2}面积之和({3}公顷)不一致，两者差值{4}公顷";
        
        public const string ERR_810160021 = "农村土地利用现状一级分类面积按权属性质汇总表中{0}村的{1}小计（{2}公顷）与该村级{3}国家所有和{4}集体所有之和（{5}公顷）不一致，两者差值{6}公顷";
        public const string ERR_810160022 = "农村土地利用现状一级分类面积按权属性质汇总表中{0}村的国家所有面积（{1}公顷）与该村各一级分类的国家所有面积之和({2}公顷)不一致，两者差值{3}公顷";
        public const string ERR_810160023 = "农村土地利用现状一级分类面积按权属性质汇总表中{0}村的集体所有面积（{1}公顷）与该村各一级地类的集体所有面积之和({2}公顷)不一致，两者差值{3}公顷";
        public const string ERR_810160024 = "农村土地利用现状一级分类面积按权属性质汇总表中{0}村的合计面积（{1}公顷）与该村各一级地类小计面积之和({2}公顷)不一致，两者差值{3}公顷";
        public const string ERR_810160025 = "农村土地利用现状一级分类面积按权属性质汇总表中的合计面积（{0}公顷）与国家所有和集体所有的面积之和（{2}公顷）不一致，两者差值{3}公顷";
        public const string ERR_810160026 = "农村土地利用现状一级分类面积按权属性质汇总表中{0}乡的合计面积（{1}公顷）与该乡所辖各村的汇总值（{2}公顷）不一致，两者差值{3}公顷";
        public const string ERR_810160027 = "农村土地利用现状一级分类面积按权属性质汇总表中合计面积（{0}公顷）与该县所辖各乡的汇总值（{1}公顷）不一致，两者差值{2}公顷";

        public const string ERR_810160041 = "基本农田情况统计表中{0}村的耕地小计面积（{1}公顷）与该村的水田、水浇地、旱地面积之和（{2}公顷）不一致，两者差值{3}公顷";
        public const string ERR_810160042 = "基本农田情况统计表中{0}村的其他地类小计面积（{1}公顷）与该村级园地、林地、草地、城镇村及工矿用地、交通运输用地、水域及水利设施用地、其他土地面积之和（{2}公顷）不一致，两者差值{3}公顷";
        public const string ERR_810160043 = "基本农田情况统计表中{0}村的合计面积（{1}公顷）与该村的耕地小计、其他地类小计面积之和（{2}公顷）不一致，两者差值{3}公顷";
        public const string ERR_810160044 = "基本农田情况统计表中{0}乡的合计（{1}公顷）与该乡所辖各村的汇总值（{2}公顷）不一致，两者差值{3}公顷";
        public const string ERR_810160045 = "基本农田情况统计表中的合计面积（{0}公顷）与该县所辖各乡的汇总值（{1}公顷）不一致，两者差值{2}公顷";

        public const string ERR_810160051 = "耕地坡度分级面积汇总表中{0}村的“{1}度--{2}度”的合计面积（{3}公顷）与该村梯田、坡地面积之和（{4}公顷）不一致，两者差值{5}公顷";
        public const string ERR_810160052 = "耕地坡度分级面积汇总表中{0}村的耕地面积（{1}公顷）与该村的平地面积、梯田及坡地面积之和（{2}公顷）不一致，两者差值{3}公顷";
        public const string ERR_810160053 = "耕地坡度分级面积汇总表中{0}乡的耕地面积（{1}公顷）与该乡所辖各村的耕地面积之和（{2}公顷）不一致，两者差值{3}公顷";
        public const string ERR_810160054 = "耕地坡度分级面积汇总表中的耕地面积（{0}公顷）与该县所辖各乡的耕地面积之和（{1}公顷）不一致，两者差值{2}公顷";
        
        /// <summary>
        /// XXX表中的XX面积（XX公顷）与YYY中的面积（YY公顷）不一致，两者差值DD公顷
        /// </summary>
        public const string ERR_8201 = "{0}中的{1}面积（{2}公顷）与{3}面积（{4}公顷）不一致，两者差值{5}公顷";
        public const string ERR_820160011 = "农村土地利用现状一级分类面积汇总表中{0}面积（{1}公顷）与数据库汇总面积（{2}公顷）不一致，两者差值{3}公顷";
        public const string ERR_820160032 = "农村土地利用现状二级分类面积汇总表中的{0}面积（{1}公顷）与数据库汇总面积（{2}公顷）不一致，两者差值{3}公顷";
        public const string ERR_820160023 = "农村土地利用分类面积权属性质汇总表中的{0}面积（{1}公顷）与数据库汇总面积（{2}公顷）不一致，两者差值{3}公顷";

        public const string ERR_820160044 = "基本农田情况统计表中的{0}面积（{1}公顷）与数据库汇总面积（{2}公顷）不一致，两者差值{3}公顷";
        public const string ERR_820160055 = "耕地坡度图分级面积汇总表中的{0}面积（{1}公顷）与数据库汇总面积（{2}公顷）不一致，两者差值{3}公顷";

        public const string ERR_EngineAPI_1 = "{0}中，属性描述值{1}和图形数据所有值{2}不匹配";

        /// <summary>
        /// 面层内要素不相互重叠、线层内要素不互相重叠
        /// </summary>
        public const string ERR_EngineAPI_2 = "{0}层内标识码为{1}的图形与层内其它图形互相重叠";

        /// <summary>
        /// 面层必须被另一个面层覆盖
        /// YSTC层标识码为SourceBSM的图形不在MBTC层标识码为TargetBSM内
        /// </summary>
        public const string ERR_EngineAPI_3_1 = "{0}层标识码为{1}的图形不在{2}层标识码为{3}内";
        public const string ERR_EngineAPI_3_2 = "{0}层标识码为{1}的图形不在{2}层内";

        /// <summary>
        /// 点必须被线覆盖
        /// YSTC层内标识码为SourceBSM的点图形不是MBTC的节点
        /// </summary>
        public const string ERR_EngineAPI_4 = "{0}层标识码为{1}的点图形不是{3}的节点,点必须被线覆盖";

        /// <summary>
        /// 面层和另一个面层边界一致
        /// YSTC层标识码为SourceBSM的图形没有和MBTC层标识码为TargetBSM的图形的边界一致
        /// </summary>
        public const string ERR_EngineAPI_5 = "{0}层标识码为{1}的图形没有和{2}层标识码为{3}的图形的边界一致";

        /// <summary>
        /// 线层内要素不能相交或内部相切
        /// YSTC层内标识码为SourceBSM的要素和TargetBSM要素部分重叠";
        /// </summary>
        public const string ERR_EngineAPI_6 = "{0}层内标识码为{1}的图形和{2}的图形部分重叠,线层内图形不能相交或内部相切";

        /// <summary>
        /// 线层必须被面层边界覆盖
        /// YSTC层内标识码为SourceBSM的要素和MBTC层的边界不重叠;
        /// </summary>
        public const string ERR_EngineAPI_7 = "{0}层内标识码为{1}的图形和{2}层的边界不重叠,线层必须被面层边界覆盖";

        /// <summary>
        /// 字段编码与标准库匹配
        /// {0}图层的字段{1}({2})编码{3}在标准编码中不存在！
        /// </summary>
        public const string ERR_RuleCode_1_1 = "{0}图层标识码为{1}的{2}({3})编码'{4}'在标准编码中不存在！";
        public const string ERR_RuleCode_1_2 = "{0}图层标识码为{1}的{2}({3})在标准编码中不存在！";
        /// <summary>
        /// 字段代码与字段名称匹配
        /// {0}图层标识码为{1}的{2}({3})和字段名称{4}({5})不匹配
        /// </summary>
        public const string ERR_RuleCode_2 = "{0}图层标识码为{1}的{2}({3})和字段名称{4}({5})不匹配";
    }
}
